In [1]:
# 라이브러리 불러오기

import pandas as pd

In [3]:
# 엑셀 데이터 불러오기

sample_1 = pd.read_excel('./files/sample_1.xlsx',
                        header=1,
                        skipfooter=2,
                        usecols='A:C')
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [4]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [5]:
# 데이터 정보 살펴보기

sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [6]:
# 기초 통계량 확인

sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [7]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [8]:
# 한 개의 컬럼 선택
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [10]:
# 여러 컬럼 선택

sample_1[['국적코드','입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [11]:
# 컬럼 생성

sample_1['기준년월'] = '2019-11'

sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [12]:
# 필터링 실습 1

condition = (sample_1['성별']=='남성')
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [13]:
# 필터링 실습 2

sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [14]:
# 필터링 실습 3

condition = (sample_1['입국객수'] >= 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [15]:
# 두 개의 컬럼에 대해 필터링하기 1

condition = (sample_1['성별'] == '남성')&(sample_1['입국객수']>=150000)
condition

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [16]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [17]:
# 두 개의 컬럼에 대해 필터링하기 3 - 가독성 높게 표현하기

condition = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >- 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [18]:
# 한 컬럼에 대해 여러 조건으로 필터링하기 1

condition = (sample_1['국적코드'] == 'A01') | (sample_1['국적코드'] == 'A18')
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [20]:
# 한 컬럼에 대해 여러 조건으로 필터링하기 2

condition = (sample_1['국적코드'].isin(['A01','A18']))
condition

0     True
1     True
2    False
3    False
4     True
5     True
Name: 국적코드, dtype: bool

In [21]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [22]:
# 한 컬럼에 대해 여러 조건으로 필터링하기 3

condition = (sample_1['국적코드'].isin(['A01','A18']))
sample_1[condition==False]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2019-11
3  A31  여성    42  2019-11

-----------

In [23]:
# 국적코드표 엑셀 파일 불러오기

code_master = pd.read_excel('./files/sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [24]:
# 데이터 옆으로 통합 (left 조건)

sample_1_code = pd.merge(left = sample_1,
                        right = code_master,
                        how = 'left',
                        left_on = '국적코드',
                        right_on = '국적코드'
                        )

sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국